//1- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).

//let time = +prompt("введіть хвилину від 0 до 59");
//if (time >= 0 && time <=14) {
//   console.log('1 чверть');
//}
 //   if (time >= 15 && time <=29) {
 //       console.log('2 чверть')
//}
//if (time >= 30 && time <=44) {
//    console.log('3 чверть')
//}
//if (time >= 45 && time <=59) {
 //   console.log('4 чверть')
//}

//else {
//    console.log('некоректні дані')
//}

//2 У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
//let day =  +prompt('введіть число місяця');
//if (day >= 1 && day <= 10) {
//    console.log('перша декада')
//}
//if (day >=11 && day <= 20) {
//    console.log('друга декада')
//}
//if (day >= 21 && day <= 31) {
//    console.log('третя декада')
//}

//else {
//    console.log("некоректні дані")
//}

//3 У нас є змінна test, якщо дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//    Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)

//let test = prompt("введіть true або щось інше");
//if (test ===  'true') {
//   console.log('вірно')
//}
//else {
//    console.log('невірно')
//}

//4 Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3
//let number = +prompt ('введіть 1 або 0 або -3')
//if (number!==0) {
//    console.log('вірно')
 //   }
//else  {
 //   console.log(('не вірно'))
//}

// let number = +prompt('Введіть число 1, 0 , -3');
// if (number !== 0){
//     console.log('ВІРНО')
// } else {
//     console.log('НЕВІРНО')

//5 Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.

//let day = +prompt('Введіть день тижня')
 //switch (day) {
  //   case 1:
  //       console.log('понеділок: встати на роботу');
  //       break;
 //    case 2:
//         console.log('вівторок: купити їсти');
//         break;
//     case 3:
//         console.log('середа: купити корм котові');
 //        break;
  //   case 4:
 //        console.log('четвер: підвезти тещу');
  //       break;
//     case 5:
//         console.log('пятниця: знову підвезти тещу');
//         break;
//       case 6:
 //        console.log('субота: викопати бульбу');
 //        break;
 //    case 7:
 //        console.log('неділя: подивитись футбол');
//         break;
//     default:
//         console.log("прошу ввести день тижня");
// }

//6 Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

 //let year = +prompt('Введіть рік');
 //if(year % 4 ===0) {
 //    console.log('високосний рік');
// }
// else {
 //    console.log('не високоний');
//}

 //- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
// Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
//let oficial_Name = prompt('JavaScript');
//if     (oficial_Name === "ECMAScript")
//{
//console.log('Правильно');
//}
//else(
//    console.log('Не знаєте? ECMAScript!')
//)


