//1 Користувач вводить або має два числа.
//    Потрібно знайти та вивести максимальне число з тих двох .
//    Також потрібно врахувати коли введені рівні числа.

//let numbers1 = +prompt("прошу ввести число 1");
// let numbers2 = +prompt( 'прошу ввести число 2')
// if (numbers1 > numbers2) {
//     console.log(numbers1)
// }
// else if (numbers1 < numbers2) {
//     console.log(numbers2)
// }
// else if (numbers1 === numbers2) {
//         console.log('число1 = числу2' )
// }



// 2 У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

// let flat = +prompt("прошу ввести номер квартири")
// if (flat >= 1 && flat <= 20) {
//     console.log("1 під'їзд")
//    document.write("1 підїзд");
// }
// else if (flat >= 21 && flat <= 48) {
//     console. log("2 під'їзд")
// }
// else if (flat >= 49 && flat <= 90) {
//     console.log("3 під'їзд")
// }


//3 Ми маємо змінну number в яку користувач задає числове значення,
// якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

// let number = +prompt("прошу ввести число")
// if (number === 10) {
//     console. log("вірно")
// }
// else  {
//     console.log("не вірно")
// }


// 4 Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//     Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//     Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

// let temperature = +prompt( "прошу ввести температуру")
// if (temperature >= +10 && temperature <= +22) {
//     console. log ("ми йдемо вчитися")
// }
// else {console. log("сидимо вдома і вчимося онлайн")}



// 5 За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

// let poleChudes = +prompt("Введите число от 1 до 5");
// switch(poleChudes)
// {
//     case 1: // // Коли poleChudes = 1 і т.д
//         alert("Вітаємо! Ви виграли автомобіль!!!");
//         break; // // Обовязково закінчуємо словом break щоб все правильно відпрацбвало і не пішло далі

let pryz = +prompt( "прошу ввести число від 1 до 5");
switch (pryz) {
    case 1:
        alert("Ви виграли телефон");
        break;
    case 2:
        alert("Ви виграли телевізор");
        break;
    case 3:
        alert("Ви виграли телефон");
        break;
    case 4:
        alert("Ви виграли сумку");
        break;
    case 5:
        alert("Ви виграли банани");
        break;
    default:
        alert("Число не вірне, Ви нічого не виграли");
}


// if (switch_case === 1) {
//     console.log("Ви виграли телефон")
// }
// else if (switch_case === 2) {
//     console.log("Ви виграли телевізор")
// }
// else if (switch_case === 3) {
//     console.log("Ви виграли телефон")
// }
// else if (switch_case === 4) {
//     console.log("Ви виграли сумку")
// }
// else if (switch_case === 5) {
//     console.log("Ви виграли банани")
// }
// else {
//     console.log("Число не вірне, Ви нічого не виграли")
// }


